# Завдання 1
# Користувач вводить вводить із клавіатури номер дня тижня (1-7). Необхідно вивести 
# на екран назву дня тижня. Наприклад, якщо 1, то на екрані напис "понеділок", 2 - "вівторок" і т.д.

a = int(input("Введіть номер дня тижня (від 1 до 7): "))

if a == 1:
    print("Це Понеділок")
elif a == 2:
    print("Це Вівторок")
elif a == 3:
    print("Це Середа")
elif a == 4:
    print("Це Четвер")
elif a == 5:
    print("Це П'ятниця")
elif a == 6:
    print("Це Субота")
elif a == 7:
    print("Це Неділя")
else:
    print("Невірно введений номер дня тижня!")

# Завдання 2
# Користувач вводить із клавіатури номер місяця (1-12). Неохідно вивести на екран назву місяця. 
# Наприклад, якщо 1, то на екрані напис "січень", 2 - "лютий" і т.д.

a = int(input("Введіть номер місяця (від 1 до 12): "))

if a == 1:
    print("Це Січень")
elif a == 2:
    print("Це Лютий")
elif a == 3:
    print("Це Березень")
elif a == 4:
    print("Це Квітень")
elif a == 5:
    print("Це Травень")
elif a == 6:
    print("Це Червень")
elif a == 7:
    print("Це Липень")
elif a == 8:
    print("Це Серпень")
elif a == 9:
    print("Це Вересень")
elif a == 10:
    print("Це Жовтень")
elif a == 11:
    print("Це Листопад")
elif a == 12:
    print("Це Греднь")
else:
    print("Невірно введений номер місяця!")

# Завдання 3
# Користувач вводить із клавіатури число. Якщо число більше нуля, потрібно вивести напис "Number is positive",
# якщо менше нуля - "Number is negative", Якщо дорівнює нулю - "Number is equal to zero".

a = int(input("Введіть число: "))

if a > 0:
    print("Number is positive")
elif a < 0:
    print("Number is negative")
elif a == 0:
    print("Number is equal to zero")

# Завдання 4
# Користувач вводить два числа. Необхідно визначити, чи ці числа є рівними і, якщо ні, 
# вивести їх на екран у порядку зростання.

num1 = int(input("Введіть перше число: "))
num2 = int(input("Введіть друге число: "))

if num1 == num2:
    print("Ці числа рівні")
elif num1 < num2:
    print(num1, num2)
elif num1 > num2:
    print(num2, num1)