print("Завдання №1")
# Користувач вводить із клавіатури два числа (початок і кінець діапазону). Потрібно проаналізувати всі 
# числа в цьому діапазоні за таким правилом: якщо число кратне 7, його треба виводити на екран.

start = int(input("Введіть початок діапазону: "))
end = int(input("Введіть кінець діапазону: "))

# print("Числа, які кратні 7:")

while start <= end:
    if start % 7 == 0:
        print("Числа, які кратні 7:", start)
    start += 1
while end <= start:
    if end % 7 == 0:
        print("Числа, які кратні 7:", end)
    end += 1
print()



print("Завдання №2")
# Користувач вводить із клавіатури два числа (початок і кінець діапазону). Необхідно проаналізувати 
# всі числа в цьому діапазоні. Потрібно вивести на екран: 
# 1. Всі числа діапазону. 
# 2. Всі числа діапазону в спадному порядку. 
# 3. Всі числа, кратні 7. 
# 4. Кількість чисел, кратних 5.

start = int(input("Введіть початок діапазону: "))
end = int(input("Введіть кінець діапазону: "))

if start > end:
    start, end = end, start

print("Всі числа діапазону:")
num1 = start
while num1 <= end:
    print(num1, end=' ')
    num1 += 1
print()

print("Всі числа діапазону в спадному порядку:")
num1 = end
while num1 >= start:
    print(num1, end=' ')
    num1 -= 1
print()

print("Числа, кратні 7:")
num1 = start
while num1 <= end:
    if num1 % 7 == 0:
        print(num1, end=' ')
    num1 += 1
print()

count = 0
num1 = start
while num1 <= end:
    if num1 % 5 == 0:
        count += 1
    num1 += 1
print("Кількість чисел, кратних 5:", count)
print()




print("Завдання №3")
# Користувач вводить із клавіатури два числа (початок і кінець діапазону). Потрібно проаналізувати всі 
# числа в цьому діапазоні. Виведення на екран має відбуватися за правилами зазначиними нижче.
# Якщо число кратне 3 (ділиться на 3 без залишку), потрібно вивести слово "Fizz".
# Якщо число кранте 5, потрібно вивести слово "Buzz".
# Якщо число кратне 3 і 5, потрібно вивести слово "Fizz Buzz".
# Якщо число не кратне ні 3, ні 5, потрібно вивести саме число.

start = int(input("Введіть початок діапазону: "))
end = int(input("Введіть кінець діапазону: "))

if start > end:
    start, end = end, start

num1 = start

while num1 <= end:
    if num1 % 3 == 0 and num1 % 5 == 0:
        print("Fizz Buzz")
    elif num1 % 3 == 0:
        print("Fizz")
    elif num1 % 5 == 0:
        print("Buzz")
    else:
        print(num1)
    num1 += 1
print()