print("")

print("Завдання 1\n")

num1 = int(input("Введіть перше число: "))
num2 = int(input("Введіть друге число: "))
num3 = int(input("Введіть трете число: "))

sum = num1 + num2 + num3
dob = num1 * num2 * num3

print("")

print("Сума чисел =", sum)
print("Добуток чисел =", dob)

print("")

print("Завдання 2\n")

num1 = int(input("Введіть вашу зарплату за місяць: "))
num2 = int(input("Введіть вашу суму місячного платежу за кредитом у банку: "))
num3 = int(input("Введіть вашу заборгованість за комунальні послуги: "))

riz = num1 - (num2 + num3)

print("Сума, яка залишилася у вас після всіх виплат:", riz)

print("")

print("Завдання 3\n")

d1 = int(input("Введіть довжину першої діагоналі ромбу: "))
d2 = int(input("Введіть довжину другої діагоналі ромбу: "))

S = (d1 * d2) // 2

print("Площа ромбу = ", S)

print("")